RIET/src/AccumulationRegisters/ImportItemsWithoutCustomsFiles/ImportItemsWithoutCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ImportItemsWithoutCustomsFiles</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ImportShipment</name>
    <type>
      <types>DocumentRef.Поставка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ImportItemsWithoutCustomsFiles/RecordSetModule.bsl
Процедура ДобавитьЗапись(ВидДвижения, Период, Item, ImportShipment) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидДвижения) Тогда
		ВызватьИсключение "Вид движения is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение "Период is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Item) Тогда
		ВызватьИсключение "Item is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ImportShipment) Тогда
		ВызватьИсключение "Import shipment is empty!";
	КонецЕсли;
	
	Движение = Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Период;
	Движение.Item = Item;
	Движение.ImportShipment = ImportShipment;
	Движение.Ресурс = 1;
	
КонецПроцедуры
